Revit 2025 API
MetallicpaintPearlType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintPearl" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MetallicpaintPearlType
Public Enumeration MetallicpaintPearlType
public enum class MetallicpaintPearlType
type MetallicpaintPearlType
Members
Member name | Value | Description
None | 0
Chromatic | 1
Custom | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace